# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [35]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names.drop(baby_names.columns[baby_names.columns.str.contains('Unnamed: 0',case=False)],axis='columns',inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names.groupby('Gender').agg({'Gender': 'count'})

        Gender
Gender
F       558846
M       457549

### Step 7. Group the dataset by name and assign to names

In [7]:
baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [8]:
len(baby_names['Name'].unique())

17632

### Step 9. What is the name with most occurrences?

In [34]:
spd= baby_names.groupby('Name').sum()
spd.sort_values('Count',ascending=False)

                    Id   Count
Name
Jacob       1665681356  242874
Emma        1629482250  214852
Michael     1687521295  214405
Ethan       1660808475  209277
Isabella    1630131786  204798
...                ...     ...
Eniola         4930126       5
Atlantis       4904427       5
Marci          4901273       5
Simarpreet      553386       5
Nita            536782       5

[17632 rows x 2 columns]

### Step 10. How many different names have the least occurrences?

In [23]:
name_count.sort_values('names',ascending=False)

         names
Name
Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
...        ...
Ethon        1
Malajah      1
Euan         1
Azyria       1
Nissen       1

[17632 rows x 1 columns]

### Step 11. What is the median name occurrence?

In [27]:
name_count[name_count['names']==8.00]

          names
Name
Abubakar      8
Adelie        8
Adira         8
Adylene       8
Aerial        8
...         ...
Zamaya        8
Zanaya        8
Zari          8
Zaylie        8
Zyanna        8

[360 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [28]:
name_count.std()

names    122.029964
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [29]:
name_count.describe()

              names
count  17632.000000
mean      57.644907
std      122.029964
min        1.000000
25%        2.000000
50%        8.000000
75%       39.000000
max     1112.000000